Tekla Open API Reference for Tekla Structures 2025
View.GetModelObjects Method
 Gets the model objects that are in the view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetModelObjects()
Public Function GetModelObjects As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
The model objects that are in the view.
See Also
Reference
View Class
GetModelObjects Overload
Tekla.Structures.Drawing Namespace